## DataFrame
- 2차원 배열 형식
- 표같은 스프레드시트 자료구조
- 여러개의 컬럼을 가지고 서로 다른 구조의 값이 담긴다.
- DataFrame은 다양한 방법으로 생성
    1. 리스트 값을 딕셔너리로 사용
    2. Numpy 배열 활용
    3. read_csv(), read_excel() 함수등을 이용

In [2]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [17]:
#1-1. 딕셔너리를 통한 DataFrame 생성

list_dic = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
            'year':[2000,2001,2002,2000,2001,2002],
            'pop':[1.5,1.7,3.6,2.4,2.9,3.2]
            }
    
liDf = DataFrame(list_dic)
liDf #DataFrame은 Series의 모임임

print(liDf.state)
print(liDf.year)
# print(liDf.pop) #pop은 내장함수임. 그래서 다 나옴
print(liDf['pop']) #대괄호 안에 싸주면 컬럼명으로 인식해서 나옴(**예약어를 변수로 썼을 때 활용)
print('*'*30)

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object
0    2000
1    2001
2    2002
3    2000
4    2001
5    2002
Name: year, dtype: int64
0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64
******************************

In [19]:
data1={'name':['아이린','슬기','웬디','조이','예리'],
      'address':['서울','대전','광주','대구','부산'],
      'age':[30,27,27,25,22]}
dicDf = DataFrame(data1)
dicDf

  name address  age
0  아이린      서울   30
1   슬기      대전   27
2   웬디      광주   27
3   조이      대구   25
4   예리      부산   22

In [22]:
np.random.seed(100)

In [27]:
#1-2 Numpy배열을 이용 :: 1)array() 2)random
#reshape안하면 Serise형태 반환함
df2 = DataFrame(np.random.randint(10,100,16).reshape(4,4),
               index=list('adcd')
               ,columns=list('abcd')) 
df2

#컬럼명 수정하기
df2.columns = ['one','two','three','four']
df2

   one  two  three  four
a   93   63     88    10
d   23   67     86    13
c   80   13     94    89
d   20   97     70    13

In [31]:
#1-3 read_csv()사용
'''
csv : Comma Seperated Value
'''
df3 = pd.read_csv('../data/tips.csv') #data까지하고 /한담에 자동완성하면 파일 볼수있음
df3

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner   2.0
1         10.34  1.66    Male     No   Sun  Dinner   3.0
2         21.01  3.50    Male     No   Sun  Dinner   3.0
3         23.68  3.31    Male     No   Sun  Dinner   2.0
4         24.59  3.61  Female     No   Sun  Dinner   4.0
..          ...   ...     ...    ...   ...     ...   ...
240       27.18  2.00  Female    Yes   Sat  Dinner   2.0
241       22.67  2.00    Male    Yes   Sat  Dinner   2.0
242       17.82  1.75    Male     No   Sat  Dinner   2.0
243       18.78  3.00  Female     No  Thur  Dinner   2.0
244       25.34   NaN     NaN    NaN   NaN     NaN   NaN

[245 rows x 7 columns]

### DataFrame - 구조 확인
- index , values, columns, dtype

In [38]:
print(df3.index)
print(df3.values)
print(df3.columns) #컬럼에 대한 정보
print(df3['tip'].dtype)
print(df3.dtypes)
print('*'*30)
df3.info() #전체 정보

RangeIndex(start=0, stop=245, step=1)
[[16.99 1.01 'Female' ... 'Sun' 'Dinner' 2.0]
 [10.34 1.66 'Male' ... 'Sun' 'Dinner' 3.0]
 [21.01 3.5 'Male' ... 'Sun' 'Dinner' 3.0]
 ...
 [17.82 1.75 'Male' ... 'Sat' 'Dinner' 2.0]
 [18.78 3.0 'Female' ... 'Thur' 'Dinner' 2.0]
 [25.34 nan nan ... nan nan nan]]
Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')
float64
total_bill    float64
tip           float64
sex            object
smoker         object
day            object
time           object
size          float64
dtype: object
******************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 245 entries, 0 to 244
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  245 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    float64
dtypes: float64(3), object(4)
memory usage: 13.5+ KB

In [41]:
# 가장 많이 사용되는 조회 함수~
df3
df3.head(1)
df3.head()
df3.head(5)
df3.tail(2)
df3.tail()
df3.info()
df3.shape #몇행 몇열인지 튜플형태로 반환

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 245 entries, 0 to 244
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  245 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    float64
dtypes: float64(3), object(4)
memory usage: 13.5+ KB

(245, 7)